//------------------------------------------------------------------------------------------------------------
//БІБЛІОТЕКИ--------------------------------------------------------------------------------------------------

#include <iostream> //basic
#include <string> //strings
#include <cstdlib> // rand, srand
#include <ctime> //time

using namespace std; //std::

//------------------------------------------------------------------------------------------------------------
//ЗМІННІ------------------------------------------------------------------------------------------------------

ЗМІННА                   РОЗМІР В БАЙТАХ                         ЗНАЧЕННЯ

char                           1               Символ ASCII

bool	                       1	           true або false

unsigned short int	           2	           від     0                   до     65 535

short int	                   2	           від     -32 768             до     32 767

unsigned long int	           4	           від     0                   до     4 294 967 295

long int	                   4	           від     -2 147 483 648      до     2 147 483 647

int (16 розрядів)	           2	           від     -32 768             до     32 767

int (32 розряди)	           4	           від     -2 147 483 648      до     2 147 483 647

unsigned int (16 розрядів)	   2	           від     0                   до     65 535

unsigned int (32 розряди)	   4	           від     0                   до     4 294 967 295

float	                       4	           від     1.2е-38             до     3.4е38

double	                       8	           від     2.2е-308            до     1.8е308

long double	                   10	           від     3.4е-4932           до     3.4е+4932

//-------------------------------------------------------------------------------------------------------------
//АРИФМЕТИЧНІ ОПЕРАТОРИ----------------------------------------------------------------------------------------

ОПЕРАТОР	      ОПИС	                   ПРИКЛАДИ

=              Привласнення 		  		a = b

+	           Додавання	          		a + b

-	           Віднімання	     	  		a - b

*	           Множення	              		a * b

/	           Ділення	              		a / b

%	           Остача від ділення	  		a % b

++	           Інкремент (збільшення значення змінної на 1)	a++

--	           Декремент (зменшення значення змінної на 1)	a--

//-------------------------------------------------------------------------------------------------------------
//ОПЕРАТОРИ ПОРІВНЯННЯ ТА ВІДНОШЕННЯ --------------------------------------------------------------------------

ОПЕРАТОР	      ОПИС	                   ПРИКЛАДИ

==			    Дорівнює					a == b

!=				Не дорівнює					a != b

>				Більше 						a > b

<				Менше                       a < b

>=				Більше дорівнює             a >= b

<=				Менше дорівнює              a <= b

//-------------------------------------------------------------------------------------------------------------
//ЛОГІЧНІ ОПЕРАТОРИ--------------------------------------------------------------------------------------------

ОПЕРАТОР	      ОПИС	                   ПРИКЛАДИ

!               Логічне (НЕ)                !a

&&		        Та (і)                      a && b

||              Або                         a || b

//-------------------------------------------------------------------------------------------------------------
//КОМЕНТАРІ----------------------------------------------------------------------------------------------------

// однострочний коментар 
/* багатострочний коментар */

//-------------------------------------------------------------------------------------------------------------
//СИНТАКСИС В ЛАПКАХ ТА КОНСОЛІ--------------------------------------------------------------------------------

В КОДІ                 РЕЗУЛЬТАТ                        ПОЯСНЕННЯ

\a					Звонок 							(!)

\b					Backspace  						(видаляє знак)

\f					Перевод страницы 				(перводить текст на одну строчку вниз)

\n					Новая строка 					(перводить текст на одну строчку вниз)

\r					Возврат каретки 

\t					Горизонтальная табуляция 		(Робить відступ в один tab)

\v					Вертикальная табуляция 			(перводить текст на одну строчку вниз)

\'					Одиночная кавычка				(')

\"					Двойная кавычка					(")

\\					Обратная косая черта		 	(\)

\?					Литерал вопросительного знака	(?)

//-------------------------------------------------------------------------------------------------------------
//СКОРОЧЕННЯ---------------------------------------------------------------------------------------------------

ІМЯ ОПЕРАТОРА	 				СИНТАКСИС	  		СЕНС

Додавання з присвоєнням			a += b		   		a = a + b

Віднімання з присвоєнням		a -= b				a = a - b

Множення з присвоєнням			a *= b				a = a * b

Ділення з присвоєнням			a /= b				a = a / b

Отримання остачі з присвоєнням	a %= b				a = a % b

//-------------------------------------------------------------------------------------------------------------
//ОПЕРАТОРИ----------------------------------------------------------------------------------------------------

СИНТАКСИС						НАЗВА						ПОЯСНЕННЯ

a[b]					Індексація Масиву			ОП. з числом з масиву (a - імя масиву, [b] - вказіник на ячейку в масиву по порядку)

*p_x                    Змінна покажчик             Використовує значення силки змінної (int x = 5; 			)
&x																						(int *p_x = &x;			)
																						(p_x = 0000007E3A8FFA04;)
																						(*p_x = 5;				)

//----------------------------------------------------------------------------------------------------------------------------------------------
//ТЕРНАРНИЙ ОПЕРАТОР----------------------------------------------------------------------------------------------------------------------------

(a < 10) ? (a = 0) : (a = 1);	          Ця конструкція заміняє структуру if() else, де (умова1) ? (якщо true) : (якщо false)
(a < 10) ? (a = 0) : (a > 10) ? (a = 1) : (a = 3);          До звичайной кончтрукції портібно добавити (умова2) ? (якщо true ) : (якщо false)

//----------------------------------------------------------------------------------------------------------------------------------------------
//if() else-------------------------------------------------------------------------------------------------------------------------------------

if (a < 10)
{
	cout << "A is lesser than 10";
}
else 
{
	cout << "A is not lesser than 10";
}

//----------------------------------------------------------------------------------------------------------------------------------------------
//while-----------------------------------------------------------------------------------------------------------------------------------------

while (a < 10)
{
	cout << "A is lesser than 10";
}

//----------------------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------------