//функція console, метод log і в дужках текст з лапками
//вивод текста
console.log('Hello World!')

//відображення всіх властивостей обєкта 
console.dir()

//відображення всіх властивостей обєкта в вигляді таблички
console.table()

/////////////ОПЕРАТОРИ///////////////
!= 		 не дорівнює (значення)
!==		 не дорівнює (значення і тип)
== 		 дорівнює (значення)
===		 дорівнює (значення і тип)
>= 		 більше або дорівнює
<= 		 менше або дорівнює
&& 		 (and)
||		 або
! 		 заперечення
**		 підняти до степеня
++		 додати 1
--		 відняти 1

////////////НАЙМЕНУВАННЯ ЗМІННІ/////////////
PascalCase 		Типи і класи
DB_PASSWORD		Для констант
camelCase		Решта випадків

////////////ВЛАСТИВОСТІ ЗМІННОЇ///////////////////////
let //можна змінювати 
const //створення константної змінної
var //бажано не використвувати

////////////ЗМІННІ///////////////////////
string		строка
boolean		логічна змінна
number		число
null		значення відсутнє (присвоєне)
undefined	не определено (за змовчуванням)
symbol		символ

object		силка

///////////ФУНКЦІЇ//////////
if (a == true)
{
}
	else
	{
	}

const objectA = {
a: 10,
b: true
}
const copyOfA = objectA
copyOfA.c = 'abc'

